; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	image1 - mode
	infrared0 - mode
	Star4 - direction
	GroundStation5 - direction
	Star6 - direction
	GroundStation7 - direction
	GroundStation8 - direction
	Star0 - direction
	GroundStation1 - direction
	Star2 - direction
	GroundStation3 - direction
	GroundStation10 - direction
	GroundStation9 - direction
	Star11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 Star0)
	(supports instrument1 image1)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation3)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(supports instrument2 infrared0)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation9)
	(calibration_target instrument2 GroundStation10)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon16)
)
(:goal (and
	(pointing satellite0 Phenomenon13)
	(have_image Star11 infrared0)
	(have_image Planet12 image1)
	(have_image Phenomenon13 image1)
	(have_image Planet14 image1)
	(have_image Planet15 infrared0)
	(have_image Phenomenon16 infrared0)
	(have_image Phenomenon17 infrared0)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 8
2. (calibrate satellite0 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 0 of 8
3. (turn_to satellite0 planet12 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet12)
   goals met: 0 of 8
4. (take_image satellite0 planet12 instrument1 image1)
   added: (have_image planet12 image1)
   goals met: 1 of 8
5. (turn_to satellite0 phenomenon17 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 phenomenon17)
   goals met: 1 of 8
6. (take_image satellite0 phenomenon17 instrument1 infrared0)
   added: (have_image phenomenon17 infrared0)
   goals met: 2 of 8
7. (turn_to satellite0 phenomenon16 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 phenomenon16)
   goals met: 2 of 8
8. (take_image satellite0 phenomenon16 instrument1 infrared0)
   added: (have_image phenomenon16 infrared0)
   goals met: 3 of 8
9. (turn_to satellite0 planet14 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 planet14)
   goals met: 3 of 8
10. (take_image satellite0 planet14 instrument1 image1)
   added: (have_image planet14 image1)
   goals met: 4 of 8
11. (turn_to satellite0 planet15 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet15)
   goals met: 4 of 8
12. (take_image satellite0 planet15 instrument1 infrared0)
   added: (have_image planet15 infrared0)
   goals met: 5 of 8
13. (turn_to satellite0 star11 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 star11)
   goals met: 5 of 8
14. (take_image satellite0 star11 instrument1 infrared0)
   added: (have_image star11 infrared0)
   goals met: 6 of 8
15. (turn_to satellite0 phenomenon13 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 phenomenon13)
   goals met: 7 of 8
16. (take_image satellite0 phenomenon13 instrument1 image1)
   added: (have_image phenomenon13 image1)
   goals met: 8 of 8
